Repository: cteotonio-rent/service-user
Catalog: src/shared/rent.exceptions/ResourceMessagesException.*.resx
Languages: pt_br

# DRIVERS_LICENSE_ALREADY_REGISTERED
source: Driver's License Category already exists.
pt_br: CNH já está registrado.

# DRIVERS_LICENSE_CATEGORY_EMPTY
source: Driver's License Category is empty.
pt_br: Categoria da CNH está vazia.

# DRIVERS_LICENSE_CATEGORY_INVALID
source: Driver's License Category is invalid.
pt_br: Categoria da CNH é inválida.

# DRIVERS_LICENSE_EMPTY
source: Driver's License is empty.
pt_br: CNH está vazia.

# EMAIL_ALREADY_REGISTERED
source: Email already exists.
pt_br: E-mail já existe

# EMAIL_EMPTY
source: The email cannot be empty.
pt_br: O e-mail não pode estar vazio.

# EMAIL_INVALID
source: The email is invalid.
pt_br: O e-mail é inválido.

# EMAIL_OR_PASSWORD_INVALID
source: Invalid email and/or password.
pt_br: E-mail e/ou senha inválidos.

# FILE_TYPE_INVALID
source: Invalid file type. Only PNG and BMP files are allowed.
pt_br: Tipo de arquivo inválido. Somente arquivos PNG e BMP são permitidos.

# LICENSE_PLATE_ALREADY_REGISTERED
source: License Plate already exists.
pt_br: Placa já existe.

# LICENSE_PLATE_EMPTY
source: License plate is empty.
pt_br: PLaca não pode estar vazia.

# MODEL_EMPTY
source: Model is empty.
pt_br: Model está vazio.

# MOTORCYCLE_NOT_AVAILABLE
source: No motorcycle available.
pt_br: Não há motos disponíveis.

# NAME_EMPTY
source: The name cannot be empty.
pt_br: O nome não pode estar vazio.

# NOTIFICATION_NOT_SEND
source: Notification was not sent to you.
pt_br: Notificação não foi enviada para você.

source: No token.
pt_br: Sem token.

# NRLE_ALREADY_REGISTERED
source: National Registry of Legal Entities already exists.
pt_br: CNPJ já está registrado.

# NRLE_EMPTY
source: National Registry of Legal Entities is empty.
pt_br: CNPJ está vazio.

# ORDER_ACCEPTED
source: Order already accepted
pt_br: Pedido já foi aceito.

# ORDER_ACCEPTED_ANOTHER_USER
source: Order accepted by another user.
pt_br: Pedido aceito por outro usuário.

source: Order not accepted
pt_br: Pedido não foi aceito.

# ORDER_NOT_AVAILABLE
source: Order is not available.
pt_br: Pedido não está disponível

# ORDER_PRICE_INVALID
source: Order Price is invalid.
pt_br: Preço do Pedido é inválido.

# PASSWORD_EMPTY
source: The password must be longer than 6 characters.
pt_br: A senha deve ter mais de 6 caracteres

# REAL_END_DATE_INVALID
source: Return date must be greater than withdrawal date.
pt_br: Data de devolução deve ser maior que a data de retirada.

# RENTAL_PLAN_DAYS_INVALID
source: Os dias do plano de aluguel são obrigatórios.
pt_br: Rental plan days are mandatory.

# RENTAL_PLAN_DAYS_NOT_ALLOWED
source: Plano de aluguel não é permitido.
pt_br: Rental plan is not allowed.

# RENTAL_PLAN_NOT_EXIST
source: Rental plan does not exist.
pt_br: Plano de locação não existe.

# RESOURCE_NOT_FOUND
source: Resource not fund.
pt_br: Recurso não encontrado.

# UNAUTHORIZED_ACCESS
source: Attempted to perform an unauthorized operation.
pt_br: Tentativa de realizar uma operação não autorizada.

source: Unknown error.
pt_br: Erro desconhecido.

# USER_WITHOUT_PERMISSION_ACCESS_RESOURCE
source: User not allowed to access the resource.
pt_br: Usuário sem permissão de acesso ao recurso.

# YEAR_EMPTY
source: Year is empty.
pt_br: Ano não pode estar vazio.

# YEAR_INVALID_IS_NOT_NUMBER
source: Year is not number.
pt_br: O ano informado não é um número.

# YEAR_QTDE_CHARACTERES_INVALID
source: Number of characteres is invalid.
pt_br: Numero de dígitos está inválido.
